//Напишите программу вычисляющую среднее арифметическое последовательности чисел. Длина последовательности неизвестна, однако последовательность оканчивается нулем и других нулевых значений не встречается. В программе запрещается использовать дополнительную память(aka массивы, списки…)
#include <iostream>

using namespace std;

int main()
{
    double a,s=0;
    int c=0;
    do {
    cin >> a;
    c++;
    s+=a;
    } while(a!=0);
    double d;
    d= s/c;
    cout << d;
    return 0;
}
